{"pageProps":{"influencers":[{"slug":"wendi-russo","frontmatter":{"name":"Wendi Russo","rank":1,"active":true,"image":"/influencers/wendi-russo.jpeg","bio":"Wendi Russo is a National Television Personality, Story Teller, Sales Leader, Brand Strategist for E-Commerce and a Media Coach.  She has helped brands expand their reach and sales through her informative and persuasive sales presentations with her 18 years of Home Shopping Sales experience on Shop HQ Channel and HSN Networks. With over 11,000 hours of non-scripted Television Home Shopping sales experience, Wendi Can help your product come to life through story telling, education and demonstrations.  If you are looking to represent your own product through a live selling platform, Wendi can teach you the techniques to sell your product quickly and effectively like a pro!","social":{"instagram":"https://wendirussotv.com/tv-host/","website":"https://wendirussotv.com/tv-host/","youtube":"https://youtu.be/ivMRx6DTVuA"},"reactiveContent":null}},{"slug":"carolann-wileczek","frontmatter":{"name":"Carolann Wileczek","rank":2,"active":true,"image":"/influencers/carolann-wileczek.jpg","bio":"I have 20+ years of Live Broadcasting experience in electronic retailing on QVC and TSC in formats ranging from 5 minute hits to 2 hour shows. While I have worked in multiple categories, I am currently representing a fashion line helping women to curate elevated casual looks while inspiring them to build a minimalist, modern wardrobe for real life. I have Worked with Multiple Brands including, NYDJ, Halston, Liz Claiborne NY, Franco Sarto, DeLonghi, Cross Pens, Oneida, Sakura, Sprigs and QVC proprietary lines creating on-air presentations in addition to working behind the scenes with production, social media, buyers, vendors and manufacturers.","social":{"instagram":"http://www.instagram.com/cwily27"},"reactiveContent":null}},{"slug":"kelly-karpe","frontmatter":{"name":"Kelly Karpe","rank":2,"active":true,"image":"/influencers/kelly-karpe.jpg","bio":"With 5+ years of live on air experience in the Home-shopping industry, Kelly has sold it all–technology, beauty, health and fitness, fashion–you name it! With a Masters degree in education, a BA in Media and Communications and a background in merchandising and sales, she is an expert at explaining and selling any product no matter how complex. When Kelly is not being a passionate advocate for brands and their products, she is a mom of 4 and a certified group fitness instructor.","social":{"instagram":"https://www.instagram.com/imkellykarpe/","tiktok":null,"youtube":null,"website":"http://www.linkedin.com/in/kelly-karpe-med-1599b9138"},"reactiveContent":null}},{"slug":"sarah-williams","frontmatter":{"name":"Sarah Williams","rank":2,"active":true,"image":"/influencers/sarah-williams.png","bio":"Sarah is a seasoned on-air host, producer, and actress that has quickly become a leader in the emerging, digital, shoppable livestreaming, space. Sarah has hosted, produced, & programmed over 500 hours of shoppable livestream content. In February 2021 she began a partnership with T3 Hair Tools as their spokesperson. In addition to representing T3 on various media channels including QVC, she has single-handedly built their shoppable livestreaming program and produces & hosts all of their broadcasts. Sarah understands the technical and creative nuances to craft an entertaining, engaging, and successful shoppable livestream. Having a wholistic approach and insight into all details of each show allows Sarah to craft successful streams that not only drive sales and conversion, but also tell a compelling brand and product story. Her unique experience has garnered her acknowledgement from fellow industry leaders and as such Sarah was the on-air consultant for the first ever, Virtual Retail 10.10 Shopping Festival. At Coresight Research’s Livestream Shopping pitch competition, Sarah was a judge alongside Guess CEO Carlos Alberini and Pharus Co-Founder Kenneth Harrell. She also participated in the livestream panel at the 2022 RTE Conference as an industry expert, and she can be heard sharing her insights on several retail and innovation focused podcasts. In her free time she enjoys watching movies with her cinephile fiancé and their pet rabbit Moose. As well as visiting family every chance she gets. In her downtime, lounging by the pool enjoying fresh, iced, Matcha Green Tea lattes.","social":{"instagram":"https://www.instagram.com/imsarah.williams/","website":"https://sarahwilliams.tv/"},"reactiveContent":null}},{"slug":"caroline-mathis","frontmatter":{"name":"Caroline Mathis","rank":3,"active":true,"image":"/influencers/caroline-mathis.jpeg","bio":"Caroline is an experienced and highly skilled livestream host with a wealth of knowledge and expertise in the field. With over 3 years of experience under her belt (over 600+ livestreams), she has become a seasoned professional, adept at hosting livestreams across a range of topics and industries.","social":{"instagram":"https://www.instagram.com/life_with_cam/","website":"https://www.aroselens.com","tiktok":"https://www.tiktok.com/@aroselens"},"reactiveContent":null}},{"slug":"sarah-pribis","frontmatter":{"name":"Sarah Pribis","rank":3,"active":true,"image":"/influencers/sarah-pribis.png","bio":"An actor, host, and content creator with 200k followers across her social channels, Sarah is a seasoned pro when it comes to live on-air experience. She graduated from NYU's Tisch School of the Arts with a double major in Theatre & Journalism, and has hosted for: Amazon Live, The Ellen Show, displayTV, Business Insider, Tribeca Film Festival, and HQ Trivia. What makes her unique is her ability to improvise, write incredible scripts, and produce eye-catching content... all while keeping it conversational, like you're talking to your best friend.","social":{"instagram":"https://www.instagram.com/sarahpribis","tiktok":"https://www.tiktok.com/@sarahpribis","youtube":"https://youtu.be/jNPeJb-FHz0","website":"https://sarahpribis.com/"},"reactiveContent":null}},{"slug":"anna-roisman","frontmatter":{"name":"Anna Roisman","rank":4,"active":true,"image":"/influencers/anna-roisman.jpg","bio":"Anna Roisman is a comedian, host, writer, actress and content creator. Anna is known for her work as the host of HQ Words and HQ Trivia, on the Emmy Nominated App. She was a regular comedian/talking head on the viral Buzzfeed series, Did You See This? (12M views) and the 90’s throwback series That Literally Happened! Anna has hosted shows for Amazon, Buzzfeed, MTV, Microsoft, and more. Recently Anna wrote and starred in sketches for NBC’s Celebrity Sleepover. Anna's work has been featured in The NY Times, LA Times, Huffington Post, Vulture, Buzzfeed, Funny Or Die, Ad Week, People, WhoHaha, MTV, Comedy Central, Elite Daily, and more. She is the creator and host of the podcast, “Unemployed With Anna Roisman,” a spinoff of her long running live stream show, The Unemployed Show which was a finalist at the 2018 NYTVF in the TruTV competition.\n","social":{"instagram":"https://www.instagram.com/annaroisman/","tiktok":"https://www.tiktok.com/@annaroisman","youtube":"https://www.youtube.com/channel/UCN5iOmu506gVHgfLvmg7uhg","website":"https://www.AnnaRoisman.com"},"reactiveContent":null}},{"slug":"marco-filipe-da-costa-novo","frontmatter":{"name":"Marco Novo","rank":5,"active":true,"image":"/influencers/marco.jpeg","bio":"Live streamer since 2015, with a marketing background. Amazon creator since 2021, with around 400 live shows made. \"Traveled\" all around the world through live streaming and my guests from 30+ different countries, and 5 continents, allowing Marco and his audience to learn, build trust, and get engaged. Being born in a small Portuguese town, was not a problem, when you combine curiosity, craziness, and will. In this journey, Marco became one of the fewest European Amazon influencers and even the fewest non-native English speaker and worked with brands like Sennheiser, Renpho, Heil Sound, Streamyard, Invideo, among others. Marco truly believes that live streaming is an amazing way to get known, build trust, and even more important, know and understand your audience to turn them into customers and ultimately, ambassadors. Besides this, he speaks Portuguese, Spanish, and English, loves sports, playing padel, European football, and futsal, loves to walk by the sea, and meanwhile, takes some photos of the sunset at the ocean.","social":{"instagram":"https://www.instagram.com/mfcnovo","website":"https://www.amazon.com/shop/mfcnovo","youtube":"https://www.youtube.com/@marcotingreviews"},"reactiveContent":null}},{"slug":"jim-fuhs","frontmatter":{"name":"Jim Fuhs","rank":10,"active":true,"image":"/influencers/jim-fuhs.jpg","bio":"Jim Fuhs is President of Fuhsion Marketing and does Marketing the Marine Corps Way. Jim takes 20+ years of highly successful leadership experience as a Marine Corps Officer and fuses it with the ever-changing world of Marketing and Technology. He can be seen as a host with Livestreamer on Amazon, with Dealcasters Live and cohost of The Tim and Jim Show. Other skills include being a remote virtual video producer, podcaster, digital marketing consultant and speaker.","social":{"instagram":"https://instagram.com/fuhsionmarketing","tiktok":null,"youtube":"https://youtube.com/c/fuhsionmarketing","website":"https://fuhsionmarketing.com/"},"reactiveContent":null}}]},"__N_SSG":true}